Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter.SchemaGuid
Schema id used to filter elements with extensible storage data
Since:
2014

Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter.#ctor(System.Guid)
Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.
schemaGuid:
Schema id used to filter elements with extensible storage data
Since:
2014

Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter
A filter used to filter elements with extensible storage data based on specific Schema id.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Since:
2014